# 181
list = [["101호", "102호"], ["201호", "202호"], ["301호", "302호"]]


"""오답"""
# 182
list = [["시가", 100, 200, 300], ["종가", 80, 210, 330]]


# 183
stock = {
  "시가" : [100, 200, 300],
  "종가" : [80, 210, 330],
}

# 184
stock = {
  "10/10" : [80, 110, 70, 90],
  "10/11" : [210, 230, 190, 200],
}


"""오답"""
# 185
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]
for 층 in apart:
  for 호 in 층:
    print(호, "호")


# 186
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]

for 층 in apart[::-1]:
  for 호 in 층:
    print(호, "호")

# 187
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]
for 층 in apart[::-1]:
  for 호 in 층[::-1]:
    print(호, "호")

# 188
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]
for 층 in apart:
  for 호 in 층:
    print(호, "호")
    print("-----")  # ("-" * 5)도 가능


"""오답"""
# 189
# 들여쓰기의 중요성
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]
for 층 in apart:
  for 호 in 층:
    print(호, "호")
  print("-----")
 

# 190
apart = [ 
  [101, 102], 
  [201, 202], 
  [301, 302] ]
for 층 in apart:
  for 호 in 층:
    print(호, "호")
print("-----")